app/controllers/posts_controller.rb

	def create
		raise params.inspect
	  @post = Post.new(params)
	  @post.save
---
INSERT INTO "posts" ("title", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "New Post"], ["description", "New Post Description\r\n"], ["created_at", "2018-06-18 16:00:10.733487"], ["updated_at", "2018-06-18 16:00:10.733487"]]